# Chapter 7 - Data Cleaning & Preparation (p.191-219)

## 7.1 Handling Missing Data (p.191)

In [1]:
import pandas as pd
import numpy as np
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])

In [2]:
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [3]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [4]:
string_data[0] = None

In [5]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

## Filtering Out Missing Data (p.193)

In [6]:
from numpy import nan as NA

In [7]:
data = pd.Series([1, NA, 3.5, NA, 7])

In [8]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [9]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [10]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],
                    [NA, NA, NA], [NA, 6.5, 3.]])

In [11]:
cleaned = data.dropna()

In [12]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [13]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [14]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [15]:
data[4] = NA

In [16]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [17]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [18]:
df = pd.DataFrame(np.random.randn(7, 3))

In [19]:
df.iloc[:4, 1] = NA

In [20]:
df.iloc[:2, 2] = NA

In [21]:
df

          0         1         2
0  1.489713       NaN       NaN
1  0.735747       NaN       NaN
2 -3.102280       NaN  0.729800
3  0.362253       NaN -0.420988
4  1.391668 -1.150227 -0.600573
5 -0.212749  0.466101 -1.601374
6  0.803251 -1.113563 -0.720908

In [22]:
df.dropna()

          0         1         2
4  1.391668 -1.150227 -0.600573
5 -0.212749  0.466101 -1.601374
6  0.803251 -1.113563 -0.720908

In [23]:
df.dropna(thresh=2)

          0         1         2
2 -3.102280       NaN  0.729800
3  0.362253       NaN -0.420988
4  1.391668 -1.150227 -0.600573
5 -0.212749  0.466101 -1.601374
6  0.803251 -1.113563 -0.720908

## Filling in Missing Data (p. 195)

In [24]:
df.fillna(0)

          0         1         2
0  1.489713  0.000000  0.000000
1  0.735747  0.000000  0.000000
2 -3.102280  0.000000  0.729800
3  0.362253  0.000000 -0.420988
4  1.391668 -1.150227 -0.600573
5 -0.212749  0.466101 -1.601374
6  0.803251 -1.113563 -0.720908

In [25]:
df.fillna({1: 0.5, 2: 0})

          0         1         2
0  1.489713  0.500000  0.000000
1  0.735747  0.500000  0.000000
2 -3.102280  0.500000  0.729800
3  0.362253  0.500000 -0.420988
4  1.391668 -1.150227 -0.600573
5 -0.212749  0.466101 -1.601374
6  0.803251 -1.113563 -0.720908

In [26]:
_ = df.fillna(0, inplace=True)

In [27]:
df

          0         1         2
0  1.489713  0.000000  0.000000
1  0.735747  0.000000  0.000000
2 -3.102280  0.000000  0.729800
3  0.362253  0.000000 -0.420988
4  1.391668 -1.150227 -0.600573
5 -0.212749  0.466101 -1.601374
6  0.803251 -1.113563 -0.720908

In [28]:
df = pd.DataFrame(np.random.randn(6, 3))

In [29]:
df.iloc[2:, 1] = NA

In [30]:
df.iloc[4:, 2] = NA

In [31]:
df

          0         1         2
0  0.695135  0.304107 -0.975806
1 -1.582879  0.210194 -0.502535
2  0.399505       NaN  2.273539
3 -0.493858       NaN -0.021290
4 -0.422480       NaN       NaN
5 -1.169874       NaN       NaN

In [32]:
df.fillna(method='ffill')

          0         1         2
0  0.695135  0.304107 -0.975806
1 -1.582879  0.210194 -0.502535
2  0.399505  0.210194  2.273539
3 -0.493858  0.210194 -0.021290
4 -0.422480  0.210194 -0.021290
5 -1.169874  0.210194 -0.021290

In [33]:
df.fillna(method='ffill', limit=2)

          0         1         2
0  0.695135  0.304107 -0.975806
1 -1.582879  0.210194 -0.502535
2  0.399505  0.210194  2.273539
3 -0.493858  0.210194 -0.021290
4 -0.422480       NaN -0.021290
5 -1.169874       NaN -0.021290

In [34]:
data = pd.Series([1., NA, 3.5, NA, 7])

In [35]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

## 7.2 Data Transformation (p.197)

### Removing Duplicates (ibd)

In [36]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
                    'k2': [1, 1, 2, 3, 3, 4, 4]})

In [37]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [38]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [39]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [40]:
data['v1'] = range(7)

In [41]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [42]:
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

### Transforming Data Using a Function or Mapping (p. 198)

In [43]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
                             'Pastrami', 'corned beef', 'Bacon',
                             'pastrami', 'honey ham', 'nova lox'],
                    'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

In [44]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [45]:
meat_to_animal = {
    'bacon': 'pig',
    'pulled pork': 'pig',
    'pastrami': 'cow',
    'corned beef': 'cow',
    'honey ham': 'pig',
    'nova lox': 'salmon'
}

In [46]:
lowercased = data['food'].str.lower()

In [47]:
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [48]:
data['animal'] = lowercased.map(meat_to_animal)

In [49]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [50]:
data['animal'] = lowercased.map(meat_to_animal)

In [51]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [52]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

### Replacing Values (p. 200)

In [53]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])

In [54]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [55]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [56]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [57]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [58]:
data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

### Renaming Axis Indexes (p.201)

In [59]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                   index=['Ohio', 'Colorado', 'New York'],
                   columns=['one', 'two', 'three', 'four'])

In [60]:
transform = lambda x: x[:4].upper()

In [61]:
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [62]:
data.index = data.index.map(transform)

In [63]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [64]:
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [65]:
data.rename(index={'OHIO': 'INDIANA'},
           columns={'three': 'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [66]:
data.rename(index={'OHIO': 'INDIANA'}, inplace=True)

In [67]:
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

## Discretization and Binning (p. 203)

In [68]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [69]:
bins = [18, 25, 35, 60, 100]

In [70]:
cats = pd.cut(ages, bins)

In [71]:
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [72]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [73]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

In [74]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [75]:
pd.cut(ages, [18, 26, 36, 61, 100], right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [76]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']

In [77]:
pd.cut(ages, bins, labels=group_names)

[Youth, Youth, Youth, YoungAdult, Youth, ..., YoungAdult, Senior, MiddleAged, MiddleAged, YoungAdult]
Length: 12
Categories (4, object): [Youth < YoungAdult < MiddleAged < Senior]

In [78]:
data = np.random.rand(20)

In [79]:
pd.cut(data, 4, precision=2)

[(0.13, 0.31], (0.66, 0.84], (0.13, 0.31], (0.66, 0.84], (0.13, 0.31], ..., (0.31, 0.49], (0.66, 0.84], (0.49, 0.66], (0.31, 0.49], (0.49, 0.66]]
Length: 20
Categories (4, interval[float64]): [(0.13, 0.31] < (0.31, 0.49] < (0.49, 0.66] < (0.66, 0.84]]

In [80]:
data = np.random.randn(1000) # Normally distributed

In [81]:
cats = pd.qcut(data, 4) # Cut into quartiles

In [82]:
cats

[(0.648, 3.33], (0.648, 3.33], (0.648, 3.33], (0.648, 3.33], (-0.0425, 0.648], ..., (-0.71, -0.0425], (0.648, 3.33], (-0.71, -0.0425], (-0.0425, 0.648], (-0.0425, 0.648]]
Length: 1000
Categories (4, interval[float64]): [(-3.098, -0.71] < (-0.71, -0.0425] < (-0.0425, 0.648] < (0.648, 3.33]]

In [83]:
pd.value_counts(cats)

(0.648, 3.33]       250
(-0.0425, 0.648]    250
(-0.71, -0.0425]    250
(-3.098, -0.71]     250
dtype: int64

In [84]:
pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.])

[(-0.0425, 1.194], (-0.0425, 1.194], (1.194, 3.33], (-0.0425, 1.194], (-0.0425, 1.194], ..., (-1.35, -0.0425], (-0.0425, 1.194], (-1.35, -0.0425], (-0.0425, 1.194], (-0.0425, 1.194]]
Length: 1000
Categories (4, interval[float64]): [(-3.098, -1.35] < (-1.35, -0.0425] < (-0.0425, 1.194] < (1.194, 3.33]]

### Detecting and Filtering Outliers (p. 205)

In [85]:
data = pd.DataFrame(np.random.randn(1000, 4))

In [86]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.047852     0.011846     0.019664    -0.012300
std       0.985493     0.983604     1.037712     1.004330
min      -2.964941    -2.953602    -2.891351    -3.315849
25%      -0.590743    -0.642730    -0.693098    -0.687158
50%      -0.001595     0.005916     0.011380    -0.007346
75%       0.701642     0.639819     0.704931     0.691070
max       3.625406     3.063656     3.100274     3.162891

In [87]:
col = data[2]

In [88]:
col[np.abs(col) > 3]

427    3.100274
700    3.005599
Name: 2, dtype: float64

In [89]:
data[(np.abs(data) > 3).any(1)]

            0         1         2         3
47   1.667878 -0.228548  1.181476 -3.189784
147  0.056052  3.063656 -0.446190  0.447755
251 -1.199494  3.015589  0.491489  0.778869
298  3.625406 -0.743913 -0.890063 -0.529521
308  0.124275 -1.778849  2.504130 -3.315849
427 -0.022109  1.589678  3.100274  0.563222
700  1.639663 -0.725055  3.005599  0.747686
844  0.638508  2.369272  0.602540  3.162891

In [90]:
data[np.abs(data) > 3] = np.sign(data) * 3

In [91]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.047227     0.011767     0.019558    -0.011958
std       0.983416     0.983361     1.037403     1.002252
min      -2.964941    -2.953602    -2.891351    -3.000000
25%      -0.590743    -0.642730    -0.693098    -0.687158
50%      -0.001595     0.005916     0.011380    -0.007346
75%       0.701642     0.639819     0.704931     0.691070
max       3.000000     3.000000     3.000000     3.000000

In [92]:
np.sign(data).head()

     0    1    2    3
0  1.0 -1.0 -1.0 -1.0
1 -1.0  1.0 -1.0  1.0
2  1.0  1.0 -1.0  1.0
3 -1.0  1.0 -1.0 -1.0
4  1.0 -1.0  1.0 -1.0

### Permutation and Random Sampling (p.206)

In [93]:
df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))

In [94]:
sampler = np.random.permutation(5)

In [95]:
sampler

array([4, 2, 0, 1, 3])

In [96]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [97]:
df.take(sampler)

    0   1   2   3
4  16  17  18  19
2   8   9  10  11
0   0   1   2   3
1   4   5   6   7
3  12  13  14  15

In [103]:
df.sample(n=3)

    0   1   2   3
2   8   9  10  11
4  16  17  18  19
3  12  13  14  15

In [104]:
choices = pd.Series([5, 7, -1, 6, 4])

In [105]:
draws = choices.sample(n=10, replace=True)

In [106]:
draws

4    4
2   -1
2   -1
0    5
0    5
3    6
2   -1
1    7
3    6
4    4
dtype: int64

### Computing Indicator/Dummy Variables (p.208)

In [108]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],
                  'data1': range(6)})

In [115]:
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [116]:
dummies = pd.get_dummies(df['key'], prefix='key')

In [117]:
df_with_dummy = df[['data1']].join(dummies)

In [118]:
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [119]:
mnames = ['movie_id', 'title', 'genres']

In [120]:
movies = pd.read_table('datasets/movielens/movies.dat', sep='::',
                      header=None, names=mnames)

<ipython-input-120-7b04f19d4c76>:1: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  movies = pd.read_table('datasets/movielens/movies.dat', sep='::',

FileNotFoundError: [Errno 2] No such file or directory: 'datasets/movielens/movies.dat'

In [121]:
all_genres = []

In [122]:
for x in movies.genres:
    all_genres.extend(x.split('|'))

NameError: name 'movies' is not defined

In [123]:
genres = pd.unique(all_genres)

In [124]:
genres

array([], dtype=float64)

In [125]:
zero_matrix = np.zeros((len(movies), len(genres)))

NameError: name 'movies' is not defined

In [126]:
dummies = pd.DataFrame(zero_matrix, columns=genres)

NameError: name 'zero_matrix' is not defined

In [127]:
gen = movies.genres[0]

NameError: name 'movies' is not defined

In [128]:
gen.split('|')

NameError: name 'gen' is not defined

In [ ]:
dummies.columns.get_indexer(gen.split(|))

In [ ]:
array([0, 1, 2])

In [129]:
for i, gen in enumerate(movies.genres):
    indices = dummies.columns.get_indexer(gen.split('|'))
    dummies.iloc[i, indices] = 1

NameError: name 'movies' is not defined

In [ ]:
movies_windic = movies.join(dummies.add_prefix('Genre_'))

In [ ]:
movies_windic.iloc[0]

In [ ]:
np.random.seed(12345)

In [ ]:
values